Revit 2026 API

# ScheduleHeightsOnSheetTitleHeight Property

---

The height of schedule title on sheet view.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double TitleHeight { get; }
```
```vb
Public ReadOnly Property TitleHeight As Double
	Get
```
```cpp
public:
property double TitleHeight {
	double get ();
}
```
```fsharp
member TitleHeight : float with get
```

#### Property Value

Double

If title is set to unshown, it will be 0.

#### Reference

ScheduleHeightsOnSheet Class

Autodesk.Revit.DB Namespace